In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [7]:
data = {'year': [
        2010, 2011, 2012,
        2010, 2011, 2012,
        2010, 2011, 2012
    ],
    'team': [
        'FCBarcelona', 'FCBarcelona',
        'FCBarcelona', 'RMadrid',
        'RMadrid', 'Rmadrid',
        'ValenciaCF', 'ValenciaCF',
        'ValenciaCF'
    ],
    'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
    'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
    'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]
}

football = pd.DataFrame(data, columns = [
    'year', 'team', 'wins', 'draws', 'losses'
    ]
)

In [8]:
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      Rmadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

In [192]:
# na_values = ':' is useful here as it turns ':' into NaN which is a null value
# isnull() can check which index has null value
edu = pd.read_csv('data/educ_figdp_1_Data.csv', na_values = ':', usecols = ['TIME', 'GEO', 'Value'])
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [36]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [38]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [39]:
edu.describe() #The result shows the count, the mean, the sd, the MIN and MAX, and the percentiles

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [45]:
edu['Value']

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

In [41]:
edu[10:14]

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

In [55]:
edu.loc[90:94, ['TIME', "GEO"]]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [67]:
edu['Value'] > 6.5 # produces a Boolean mask with True or False for each row

0      False
1      False
2      False
3      False
4      False
       ...
379    False
380    False
381     True
382     True
383     True
Name: Value, Length: 384, dtype: bool

In [66]:
edu[edu['Value'] > 6.5].head() # filtered DataFrame containing only rows with values higher than 6.5

     TIME      GEO  Value
93   2009  Belgium   6.57
94   2010  Belgium   6.58
95   2011  Belgium   6.55
120  2000  Denmark   8.28
121  2001  Denmark   8.44

In [70]:
edu['Value'].count()

361

In [78]:
edu[edu['Value'].isnull()]

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
36   2000       Euro area (18 countries)    NaN
37   2001       Euro area (18 countries)    NaN
48   2000       Euro area (17 countries)    NaN
49   2001       Euro area (17 countries)    NaN
60   2000       Euro area (15 countries)    NaN
72   2000       Euro area (13 countries)    NaN
84   2000                        Belgium    NaN
174  2006                         Greece    NaN
175  2007                         Greece    NaN
176  2008                         Greece    NaN
177  2009                         Greece    NaN
178  2010                         Greece    NaN
179  2011                         Greece    NaN
252  2000                     Luxembourg    NaN
260  2008                     Luxembourg    NaN
261  2009                     Luxembourg    NaN
262  2010                     Luxembourg    NaN
263  2011                     Luxembourg    NaN
342  2006                        Romania    NaN
344  2008                        Romania    NaN
348  2000                       Slovenia    NaN

In [88]:
edu.max(axis = 0)

TIME      2011
GEO      Spain
Value     8.81
dtype: object

<img src='./axis.png'>

reference: https://stackoverflow.com/questions/22149584/what-does-axis-in-pandas-mean

In [91]:
print("Pandas max function:", edu['Value'].max())
print("Python max function:", max(edu['Value']))

Pandas max function: 8.81
Python max function: nan

Using function from Numpy
======

In [97]:
s = edu['Value'].apply(np.sqrt)
s.head()

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [101]:
s = edu['Value'].apply(lambda x: x**2) # 'x' can be other characters
s.head()

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

Add a new column to a DataFrame
==

In [110]:
print(edu['Value'].max())

8.81

In [137]:
edu['ValueNorm'] = edu['Value']/edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

Remove a cloumn from a DataFrame
==

In [138]:
# Drop function returns a copy of the modified data, instead of overwriting the DataFrame. 
# Therefore, the original DataFrame is kept.
# [inplace = True] removes the values from the DataFrame
edu.drop('ValueNorm', axis = 1, inplace = True) 
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

Add a new row at the bottom of the DataFrame
==

In [194]:
df1 = pd.DataFrame( # Create a new DataFrame object
    [[2000, 'a', 5.0]], #no matter how many new rows are there, always start with a list:[]
    columns=['TIME', 'GEO', 'Value'],
)

edu = pd.concat([edu, df1], ignore_index = True) # There are differences between [df1, edu] and [edu, df1].
print(edu)

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76
384  2000                              a   5.00
385  2000                              a   5.00

[386 rows x 3 columns]

In [196]:
edu.drop(max(edu.index), axis = 0, inplace = True)
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

Dropping All Rows with Missing Value or NA, NaN, etc.
==

In [206]:
# set how keyword to 'any' or 'all'
# Restrict dropna function to a subset of columns
eduDrop = edu.dropna(how = 'any', subset = ['Value'])

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.dropna.html

In [208]:
eduDrop.head()

   TIME                            GEO  Value
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95
5  2005  European Union (28 countries)   4.92
6  2006  European Union (28 countries)   4.91

Filling the Missing Value or NA, NaN, etc. with another value
==

In [209]:
eduFilled = edu.fillna(value = {"Value": 0})

In [210]:
eduFilled.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)   0.00
1  2001  European Union (28 countries)   0.00
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

Reference: https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.fillna.html

Sorting by descending order
==

In [212]:
edu.sort_values(by = 'Value', ascending = False,
               inplace = True)

In [213]:
edu.head()

     TIME      GEO  Value
130  2010  Denmark   8.81
131  2011  Denmark   8.75
129  2009  Denmark   8.74
121  2001  Denmark   8.44
122  2002  Denmark   8.44

Return to original order
==

In [214]:
edu.sort_index(axis = 0, ascending = True, inplace = True)

In [215]:
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95